In [14]:
import psycopg2
from dotenv import load_dotenv
import os

load_dotenv()

conn = psycopg2.connect(
    host=os.getenv('POSTGRES_HOST'),
    database=os.getenv('POSTGRES_DATABASE'),
    user=os.getenv('POSTGRES_USER'),
    password=os.getenv('POSTGRES_PASSWORD'),
    port=os.getenv('POSTGRES_PORT')
)

cursor = conn.cursor()
print('Conexão estabelecida com sucesso!')

Conexão estabelecida com sucesso!

In [ ]:
%pip install -r requirements.txt

In [11]:
import mysql.connector

conn_mysql = mysql.connector.connect(
    host=os.getenv('MYSQL_HOST'),
    database=os.getenv('MYSQL_DATABASE'),
    user=os.getenv('MYSQL_USER'),
    password=os.getenv('MYSQL_PASSWORD')
)

cursor_mysql = conn_mysql.cursor()
print('Conexão MySQL estabelecida com sucesso!')

Conexão MySQL estabelecida com sucesso!

In [17]:
import pandas as pd

query = """
SELECT 'Empresa 01' as empresa, nome_vendedor, sum(valor_venda) as total_vendas        
FROM datadt_curso_python.vendas
GROUP BY nome_vendedor
"""

df = pd.read_sql(query, conn_mysql)
df

C:\Users\danie\AppData\Local\Temp\ipykernel_12524\3873192840.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn_mysql)

      empresa      nome_vendedor  total_vendas
0  Empresa 01       Aline Sutter       6051.99
1  Empresa 01       Ana Teixeira      29221.12
2  Empresa 01      André Pereira      87964.89
3  Empresa 01      Artur Moreira      49944.79
4  Empresa 01  Fernando Zambrini      21225.64
5  Empresa 01       Josias Silva      50544.17
6  Empresa 01    Maria Fernandes      55997.66
7  Empresa 01   Mateus Gonçalves      36353.69
8  Empresa 01   Rodrigo Fagundes      23777.16

In [16]:
query_pg = """
SELECT 'Empresa 02' as empresa, pf.nome as nome_vendedor, sum(valor) as total_vendas
FROM vendas.nota_fiscal nf
JOIN geral.pessoa_fisica pf ON pf.id = nf.id_vendedor
GROUP BY pf.nome
"""

df_pg = pd.read_sql(query_pg, conn)
df_pg

C:\Users\danie\AppData\Local\Temp\ipykernel_12524\1682619871.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_pg = pd.read_sql(query_pg, conn)

       empresa                    nome_vendedor  total_vendas
0   Empresa 02           MARIA DO SOCORRO ALVES     4129952.0
1   Empresa 02          ANA PAULA DA SILVA LIMA     3916281.0
2   Empresa 02       ANANDA ROSA BESERRA SANTOS     3273739.0
3   Empresa 02     WELLINGTON DA SILVA DE SOUSA     3786323.0
4   Empresa 02            FLAVIA DA SILVA COSTA     3646854.0
5   Empresa 02              JOSE LOPES DA SILVA     3633685.0
6   Empresa 02             ALICE ALVES TIBURCIO     3818268.0
7   Empresa 02         MARIA APARECIDA DE SOUSA     3603034.0
8   Empresa 02       MARIA DE FATIMA DOS SANTOS     3787006.0
9   Empresa 02          ANDERSON GOMES DA SILVA     3632866.0
10  Empresa 02          BARBARA BATISTA PEREIRA     3461915.0
11  Empresa 02         MARIA DE FATIMA DA SILVA     3678364.0
12  Empresa 02   FRANCISCO BRUNO ALVES DA SILVA     3620265.0
13  Empresa 02        FRANCISCO CARLOS DA SILVA     7282299.0
14  Empresa 02           ANTONIO ALVES DA SILVA     3943474.0
15  Empresa 02               ANA PAULA DA SILVA     3740931.0
16  Empresa 02    LARISSA GONCALVES DE OLIVEIRA     3789289.0
17  Empresa 02         ANTONIA MOREIRA DA SILVA     3814046.0
18  Empresa 02              JOAO PAULO DA SILVA     3489584.0
19  Empresa 02           SILVANIA DA SILVA LIMA     3535457.0
20  Empresa 02  MARIA DAS GRAÇAS SILVA DE SOUSA     3867710.0
21  Empresa 02           MATEUS SANTOS DA SILVA     3646773.0
22  Empresa 02      FRANCISCO FERREIRA DA SILVA     3464433.0

In [18]:
df_uniao = pd.concat([df_pg, df], ignore_index=True)

In [19]:
df_uniao

       empresa                    nome_vendedor  total_vendas
0   Empresa 02           MARIA DO SOCORRO ALVES    4129952.00
1   Empresa 02          ANA PAULA DA SILVA LIMA    3916281.00
2   Empresa 02       ANANDA ROSA BESERRA SANTOS    3273739.00
3   Empresa 02     WELLINGTON DA SILVA DE SOUSA    3786323.00
4   Empresa 02            FLAVIA DA SILVA COSTA    3646854.00
5   Empresa 02              JOSE LOPES DA SILVA    3633685.00
6   Empresa 02             ALICE ALVES TIBURCIO    3818268.00
7   Empresa 02         MARIA APARECIDA DE SOUSA    3603034.00
8   Empresa 02       MARIA DE FATIMA DOS SANTOS    3787006.00
9   Empresa 02          ANDERSON GOMES DA SILVA    3632866.00
10  Empresa 02          BARBARA BATISTA PEREIRA    3461915.00
11  Empresa 02         MARIA DE FATIMA DA SILVA    3678364.00
12  Empresa 02   FRANCISCO BRUNO ALVES DA SILVA    3620265.00
13  Empresa 02        FRANCISCO CARLOS DA SILVA    7282299.00
14  Empresa 02           ANTONIO ALVES DA SILVA    3943474.00
15  Empresa 02               ANA PAULA DA SILVA    3740931.00
16  Empresa 02    LARISSA GONCALVES DE OLIVEIRA    3789289.00
17  Empresa 02         ANTONIA MOREIRA DA SILVA    3814046.00
18  Empresa 02              JOAO PAULO DA SILVA    3489584.00
19  Empresa 02           SILVANIA DA SILVA LIMA    3535457.00
20  Empresa 02  MARIA DAS GRAÇAS SILVA DE SOUSA    3867710.00
21  Empresa 02           MATEUS SANTOS DA SILVA    3646773.00
22  Empresa 02      FRANCISCO FERREIRA DA SILVA    3464433.00
23  Empresa 01                     Aline Sutter       6051.99
24  Empresa 01                     Ana Teixeira      29221.12
25  Empresa 01                    André Pereira      87964.89
26  Empresa 01                    Artur Moreira      49944.79
27  Empresa 01                Fernando Zambrini      21225.64
28  Empresa 01                     Josias Silva      50544.17
29  Empresa 01                  Maria Fernandes      55997.66
30  Empresa 01                 Mateus Gonçalves      36353.69
31  Empresa 01                 Rodrigo Fagundes      23777.16